{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<eos>": 1,
      "<unk>": 2,
      "!": 3,
      "\"": 4,
      "#": 5,
      "$": 6,
      "%": 7,
      "&": 8,
      "'": 9,
      "(": 10,
      ")": 11,
      "*": 12,
      "+": 13,
      ",": 14,
      "-": 15,
      ".": 16,
      "/": 17,
      "0": 18,
      "1": 19,
      "2": 20,
      "3": 21,
      "4": 22,
      "5": 23,
      "6": 24,
      "7": 25,
      "8": 26,
      "9": 27,
      ":": 28,
      ";": 29,
      "<": 30,
      "=": 31,
      ">": 32,
      "?": 33,
      "@": 34,
      "A": 35,
      "B": 36,
      "C": 37,
      "D": 38,
      "E": 39,
      "F": 40,
      "G": 41,
      "H": 42,
      "I": 43,
      "J": 44,
      "K": 45,
      "L": 46,
      "M": 47,
      "N": 48,
      "O": 49,
      "P": 50,
      "Q": 51,
      "R": 52,
      "S": 53,
      "T": 54,
      "U": 55,
      "V": 56,
      "W": 57,
      "X": 58,
      "Y": 59,
      "Z": 60,
      "[": 61,
      "\\": 62,
      "]": 63,
      "^": 64,
      "_": 65,
      "`": 66,
      "a": 67,
      "b": 68,
      "c": 69,
      "d": 70,
      "e": 71,
      "f": 72,
      "g": 73,
      "h": 74,
      "i": 75,
      "j": 76,
      "k": 77,
      "l": 78,
      "m": 79,
      "n": 80,
      "o": 81,
      "p": 82,
      "q": 83,
      "r": 84,
      "s": 85,
      "t": 86,
      "u": 87,
      "v": 88,
      "w": 89,
      "x": 90,
      "y": 91,
      "z": 92,
      "{": 93,
      "|": 94,
      "}": 95,
      "~": 96,
      "ВЎ": 97,
      "Вў": 98,
      "ВЈ": 99,
      "ВӨ": 100,
      "ВҘ": 101,
      "ВҰ": 102,
      "В§": 103,
      "ВЁ": 104,
      "В©": 105,
      "ВӘ": 106,
      "В«": 107,
      "В¬": 108,
      "В®": 109,
      "ВҜ": 110,
      "В°": 111,
      "Вұ": 112,
      "ВІ": 113,
      "Ві": 114,
      "Вҙ": 115,
      "Вө": 116,
      "В¶": 117,
      "В·": 118,
      "Вё": 119,
      "В№": 120,
      "Вә": 121,
      "В»": 122,
      "Вј": 123,
      "ВҪ": 124,
      "Вҫ": 125,
      "Вҝ": 126,
      "ГҖ": 127,
      "ГҒ": 128,
      "ГӮ": 129,
      "Гғ": 130,
      "Г„": 131,
      "Г…": 132,
      "ГҶ": 133,
      "ГҮ": 134,
      "ГҲ": 135,
      "Гү": 136,
      "ГҠ": 137,
      "ГӢ": 138,
      "ГҢ": 139,
      "ГҚ": 140,
      "ГҺ": 141,
      "ГҸ": 142,
      "Гҗ": 143,
      "Г‘": 144,
      "Г’": 145,
      "Г“": 146,
      "Г”": 147,
      "Г•": 148,
      "Г–": 149,
      "Г—": 150,
      "Гҳ": 151,
      "Гҷ": 152,
      "Гҡ": 153,
      "Гӣ": 154,
      "Гң": 155,
      "Гқ": 156,
      "Гһ": 157,
      "Гҹ": 158,
      "Г ": 159,
      "ГЎ": 160,
      "Гў": 161,
      "ГЈ": 162,
      "ГӨ": 163,
      "ГҘ": 164,
      "ГҰ": 165,
      "Г§": 166,
      "ГЁ": 167,
      "Г©": 168,
      "ГӘ": 169,
      "Г«": 170,
      "Г¬": 171,
      "Гӯ": 172,
      "Г®": 173,
      "ГҜ": 174,
      "Г°": 175,
      "Гұ": 176,
      "ГІ": 177,
      "Гі": 178,
      "Гҙ": 179,
      "Гө": 180,
      "Г¶": 181,
      "Г·": 182,
      "Гё": 183,
      "Г№": 184,
      "Гә": 185,
      "Г»": 186,
      "Гј": 187,
      "ГҪ": 188,
      "Гҫ": 189,
      "Гҝ": 190,
      "ДҖ": 191,
      "ДҒ": 192,
      "ДӮ": 193,
      "Дғ": 194,
      "Д„": 195,
      "Д…": 196,
      "ДҶ": 197,
      "ДҮ": 198,
      "ДҲ": 199,
      "Дү": 200,
      "ДҠ": 201,
      "ДӢ": 202,
      "ДҢ": 203,
      "ДҚ": 204,
      "ДҺ": 205,
      "ДҸ": 206,
      "Дҗ": 207,
      "Д‘": 208,
      "Д’": 209,
      "Д“": 210,
      "Д”": 211,
      "Д•": 212,
      "Д–": 213,
      "Д—": 214,
      "Дҳ": 215,
      "Дҷ": 216,
      "Дҡ": 217,
      "Дӣ": 218,
      "Дң": 219,
      "Дқ": 220,
      "Дһ": 221,
      "Дҹ": 222,
      "Д ": 223,
      "ДЎ": 224,
      "Дў": 225,
      "ДЈ": 226,
      "ДӨ": 227,
      "ДҘ": 228,
      "ДҰ": 229,
      "Д§": 230,
      "ДЁ": 231,
      "Д©": 232,
      "ДӘ": 233,
      "Д«": 234,
      "Д¬": 235,
      "Дӯ": 236,
      "Д®": 237,
      "ДҜ": 238,
      "Д°": 239,
      "Дұ": 240,
      "ДІ": 241,
      "Ді": 242,
      "Дҙ": 243,
      "Дө": 244,
      "Д¶": 245,
      "Д·": 246,
      "Дё": 247,
      "Д№": 248,
      "Дә": 249,
      "Д»": 250,
      "Дј": 251,
      "ДҪ": 252,
      "Дҫ": 253,
      "Дҝ": 254,
      "ЕҖ": 255,
      "ЕҒ": 256,
      "ЕӮ": 257,
      "Еғ": 258,
      "Д x": 259,
      "Д xe": 260,
      "Д xa": 261,
      "Д xb": 262,
      "Д xf": 263,
      "Д xc": 264,
      "Д xd": 265,
      "15": 266,
      "93": 267,
      "11": 268,
      "65": 269,
      "Д xfb": 270,
      "Д xad": 271,
      "Д xed": 272,
      "Д xeb": 273,
      "Д xcc": 274,
      "19": 275,
      "20": 276,
      "45": 277,
      "Д xfa": 278,
      "92": 279,
      "Д xbb": 280,
      "43": 281,
      "Д xdb": 282,
      "16": 283,
      "95": 284,
      "18": 285,
      "Д xba": 286,
      "Д xbc": 287,
      "61": 288,
      "86": 289,
      "63": 290,
      "38": 291,
      "46": 292,
      "57": 293,
      "59": 294,
      "79": 295,
      "01": 296,
      "Д xab": 297,
      "74": 298,
      "48": 299,
      "Д xcf": 300,
      "27": 301,
      "07": 302,
      "66": 303,
      "56": 304,
      "39": 305,
      "91": 306,
      "52": 307,
      "14": 308,
      "Д xbd": 309,
      "08": 310,
      "25": 311,
      "49": 312,
      "51": 313,
      "60": 314,
      "41": 315,
      "73": 316,
      "28": 317,
      "Д xfd": 318,
      "50": 319,
      "Д xaa": 320,
      "04": 321,
      "Д xbf": 322,
      "42": 323,
      "03": 324,
      "33": 325,
      "Д xdd": 326,
      "88": 327,
      "Д xaf": 328,
      "69": 329,
      "Д xda": 330,
      "84": 331,
      "72": 332,
      "89": 333,
      "94": 334,
      "97": 335,
      "00": 336,
      "10": 337,
      "12": 338,
      "29": 339,
      "67": 340,
      "90": 341,
      "80": 342,
      "55": 343,
      "71": 344,
      "54": 345,
      "31": 346,
      "53": 347,
      "64": 348,
      "76": 349,
      "70": 350,
      "40": 351,
      "02": 352,
      "81": 353,
      "17": 354,
      "82": 355,
      "Д xcb": 356,
      "36": 357,
      "87": 358,
      "Д xac": 359,
      "62": 360,
      "Д xce": 361,
      "Д xff": 362,
      "32": 363,
      "06": 364,
      "22": 365,
      "96": 366,
      "78": 367,
      "85": 368,
      "47": 369,
      "68": 370,
      "09": 371,
      "34": 372,
      "Д xec": 373,
      "30": 374,
      "Д xee": 375,
      "Д xdc": 376,
      "21": 377,
      "Д xca": 378,
      "13": 379,
      "44": 380,
      "Д xdf": 381,
      "24": 382,
      "99": 383,
      "23": 384,
      "26": 385,
      "05": 386,
      "Д xfe": 387,
      "Д xef": 388,
      "Д xfc": 389,
      "37": 390,
      "83": 391,
      "58": 392,
      "Д xde": 393,
      "75": 394,
      "Д xae": 395,
      "98": 396,
      "Д xea": 397,
      "77": 398,
      "Д xbe": 399,
      "Д xcd": 400,
      "35": 401,
      "xa": 402,
      "xc": 403,
      "xd": 404,
      "xb": 405,
      "xe": 406,
      "xf": 407,
      "xab": 408,
      "xcc": 409,
      "xac": 410,
      "xae": 411,
      "xce": 412,
      "xde": 413,
      "xec": 414,
      "xad": 415,
      "xdb": 416,
      "xbc": 417,
      "xef": 418,
      "xff": 419,
      "xaa": 420,
      "xca": 421,
      "xcf": 422,
      "xda": 423,
      "xdc": 424,
      "xdf": 425,
      "xbb": 426,
      "xed": 427,
      "xfa": 428,
      "xfb": 429,
      "xfd": 430,
      "xfe": 431
    },
    "merges": [
      [
        "Д ",
        "x"
      ],
      [
        "Д x",
        "e"
      ],
      [
        "Д x",
        "a"
      ],
      [
        "Д x",
        "b"
      ],
      [
        "Д x",
        "f"
      ],
      [
        "Д x",
        "c"
      ],
      [
        "Д x",
        "d"
      ],
      [
        "1",
        "5"
      ],
      [
        "9",
        "3"
      ],
      [
        "1",
        "1"
      ],
      [
        "6",
        "5"
      ],
      [
        "Д xf",
        "b"
      ],
      [
        "Д xa",
        "d"
      ],
      [
        "Д xe",
        "d"
      ],
      [
        "Д xe",
        "b"
      ],
      [
        "Д xc",
        "c"
      ],
      [
        "1",
        "9"
      ],
      [
        "2",
        "0"
      ],
      [
        "4",
        "5"
      ],
      [
        "Д xf",
        "a"
      ],
      [
        "9",
        "2"
      ],
      [
        "Д xb",
        "b"
      ],
      [
        "4",
        "3"
      ],
      [
        "Д xd",
        "b"
      ],
      [
        "1",
        "6"
      ],
      [
        "9",
        "5"
      ],
      [
        "1",
        "8"
      ],
      [
        "Д xb",
        "a"
      ],
      [
        "Д xb",
        "c"
      ],
      [
        "6",
        "1"
      ],
      [
        "8",
        "6"
      ],
      [
        "6",
        "3"
      ],
      [
        "3",
        "8"
      ],
      [
        "4",
        "6"
      ],
      [
        "5",
        "7"
      ],
      [
        "5",
        "9"
      ],
      [
        "7",
        "9"
      ],
      [
        "0",
        "1"
      ],
      [
        "Д xa",
        "b"
      ],
      [
        "7",
        "4"
      ],
      [
        "4",
        "8"
      ],
      [
        "Д xc",
        "f"
      ],
      [
        "2",
        "7"
      ],
      [
        "0",
        "7"
      ],
      [
        "6",
        "6"
      ],
      [
        "5",
        "6"
      ],
      [
        "3",
        "9"
      ],
      [
        "9",
        "1"
      ],
      [
        "5",
        "2"
      ],
      [
        "1",
        "4"
      ],
      [
        "Д xb",
        "d"
      ],
      [
        "0",
        "8"
      ],
      [
        "2",
        "5"
      ],
      [
        "4",
        "9"
      ],
      [
        "5",
        "1"
      ],
      [
        "6",
        "0"
      ],
      [
        "4",
        "1"
      ],
      [
        "7",
        "3"
      ],
      [
        "2",
        "8"
      ],
      [
        "Д xf",
        "d"
      ],
      [
        "5",
        "0"
      ],
      [
        "Д xa",
        "a"
      ],
      [
        "0",
        "4"
      ],
      [
        "Д xb",
        "f"
      ],
      [
        "4",
        "2"
      ],
      [
        "0",
        "3"
      ],
      [
        "3",
        "3"
      ],
      [
        "Д xd",
        "d"
      ],
      [
        "8",
        "8"
      ],
      [
        "Д xa",
        "f"
      ],
      [
        "6",
        "9"
      ],
      [
        "Д xd",
        "a"
      ],
      [
        "8",
        "4"
      ],
      [
        "7",
        "2"
      ],
      [
        "8",
        "9"
      ],
      [
        "9",
        "4"
      ],
      [
        "9",
        "7"
      ],
      [
        "0",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "1",
        "2"
      ],
      [
        "2",
        "9"
      ],
      [
        "6",
        "7"
      ],
      [
        "9",
        "0"
      ],
      [
        "8",
        "0"
      ],
      [
        "5",
        "5"
      ],
      [
        "7",
        "1"
      ],
      [
        "5",
        "4"
      ],
      [
        "3",
        "1"
      ],
      [
        "5",
        "3"
      ],
      [
        "6",
        "4"
      ],
      [
        "7",
        "6"
      ],
      [
        "7",
        "0"
      ],
      [
        "4",
        "0"
      ],
      [
        "0",
        "2"
      ],
      [
        "8",
        "1"
      ],
      [
        "1",
        "7"
      ],
      [
        "8",
        "2"
      ],
      [
        "Д xc",
        "b"
      ],
      [
        "3",
        "6"
      ],
      [
        "8",
        "7"
      ],
      [
        "Д xa",
        "c"
      ],
      [
        "6",
        "2"
      ],
      [
        "Д xc",
        "e"
      ],
      [
        "Д xf",
        "f"
      ],
      [
        "3",
        "2"
      ],
      [
        "0",
        "6"
      ],
      [
        "2",
        "2"
      ],
      [
        "9",
        "6"
      ],
      [
        "7",
        "8"
      ],
      [
        "8",
        "5"
      ],
      [
        "4",
        "7"
      ],
      [
        "6",
        "8"
      ],
      [
        "0",
        "9"
      ],
      [
        "3",
        "4"
      ],
      [
        "Д xe",
        "c"
      ],
      [
        "3",
        "0"
      ],
      [
        "Д xe",
        "e"
      ],
      [
        "Д xd",
        "c"
      ],
      [
        "2",
        "1"
      ],
      [
        "Д xc",
        "a"
      ],
      [
        "1",
        "3"
      ],
      [
        "4",
        "4"
      ],
      [
        "Д xd",
        "f"
      ],
      [
        "2",
        "4"
      ],
      [
        "9",
        "9"
      ],
      [
        "2",
        "3"
      ],
      [
        "2",
        "6"
      ],
      [
        "0",
        "5"
      ],
      [
        "Д xf",
        "e"
      ],
      [
        "Д xe",
        "f"
      ],
      [
        "Д xf",
        "c"
      ],
      [
        "3",
        "7"
      ],
      [
        "8",
        "3"
      ],
      [
        "5",
        "8"
      ],
      [
        "Д xd",
        "e"
      ],
      [
        "7",
        "5"
      ],
      [
        "Д xa",
        "e"
      ],
      [
        "9",
        "8"
      ],
      [
        "Д xe",
        "a"
      ],
      [
        "7",
        "7"
      ],
      [
        "Д xb",
        "e"
      ],
      [
        "Д xc",
        "d"
      ],
      [
        "3",
        "5"
      ],
      [
        "x",
        "a"
      ],
      [
        "x",
        "c"
      ],
      [
        "x",
        "d"
      ],
      [
        "x",
        "b"
      ],
      [
        "x",
        "e"
      ],
      [
        "x",
        "f"
      ],
      [
        "xa",
        "b"
      ],
      [
        "xc",
        "c"
      ],
      [
        "xa",
        "c"
      ],
      [
        "xa",
        "e"
      ],
      [
        "xc",
        "e"
      ],
      [
        "xd",
        "e"
      ],
      [
        "xe",
        "c"
      ],
      [
        "xa",
        "d"
      ],
      [
        "xd",
        "b"
      ],
      [
        "xb",
        "c"
      ],
      [
        "xe",
        "f"
      ],
      [
        "xf",
        "f"
      ],
      [
        "xa",
        "a"
      ],
      [
        "xc",
        "a"
      ],
      [
        "xc",
        "f"
      ],
      [
        "xd",
        "a"
      ],
      [
        "xd",
        "c"
      ],
      [
        "xd",
        "f"
      ],
      [
        "xb",
        "b"
      ],
      [
        "xe",
        "d"
      ],
      [
        "xf",
        "a"
      ],
      [
        "xf",
        "b"
      ],
      [
        "xf",
        "d"
      ],
      [
        "xf",
        "e"
      ]
    ]
  }
}