{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<eos>": 1,
      "<unk>": 2,
      "!": 3,
      "\"": 4,
      "#": 5,
      "$": 6,
      "%": 7,
      "&": 8,
      "'": 9,
      "(": 10,
      ")": 11,
      "*": 12,
      "+": 13,
      ",": 14,
      "-": 15,
      ".": 16,
      "/": 17,
      "0": 18,
      "1": 19,
      "2": 20,
      "3": 21,
      "4": 22,
      "5": 23,
      "6": 24,
      "7": 25,
      "8": 26,
      "9": 27,
      ":": 28,
      ";": 29,
      "<": 30,
      "=": 31,
      ">": 32,
      "?": 33,
      "@": 34,
      "A": 35,
      "B": 36,
      "C": 37,
      "D": 38,
      "E": 39,
      "F": 40,
      "G": 41,
      "H": 42,
      "I": 43,
      "J": 44,
      "K": 45,
      "L": 46,
      "M": 47,
      "N": 48,
      "O": 49,
      "P": 50,
      "Q": 51,
      "R": 52,
      "S": 53,
      "T": 54,
      "U": 55,
      "V": 56,
      "W": 57,
      "X": 58,
      "Y": 59,
      "Z": 60,
      "[": 61,
      "\\": 62,
      "]": 63,
      "^": 64,
      "_": 65,
      "`": 66,
      "a": 67,
      "b": 68,
      "c": 69,
      "d": 70,
      "e": 71,
      "f": 72,
      "g": 73,
      "h": 74,
      "i": 75,
      "j": 76,
      "k": 77,
      "l": 78,
      "m": 79,
      "n": 80,
      "o": 81,
      "p": 82,
      "q": 83,
      "r": 84,
      "s": 85,
      "t": 86,
      "u": 87,
      "v": 88,
      "w": 89,
      "x": 90,
      "y": 91,
      "z": 92,
      "{": 93,
      "|": 94,
      "}": 95,
      "~": 96,
      "┬í": 97,
      "┬ó": 98,
      "┬ú": 99,
      "┬ñ": 100,
      "┬Ñ": 101,
      "┬ª": 102,
      "┬º": 103,
      "┬¿": 104,
      "┬⌐": 105,
      "┬¬": 106,
      "┬½": 107,
      "┬¼": 108,
      "┬«": 109,
      "┬»": 110,
      "┬░": 111,
      "┬▒": 112,
      "┬▓": 113,
      "┬│": 114,
      "┬┤": 115,
      "┬╡": 116,
      "┬╢": 117,
      "┬╖": 118,
      "┬╕": 119,
      "┬╣": 120,
      "┬║": 121,
      "┬╗": 122,
      "┬╝": 123,
      "┬╜": 124,
      "┬╛": 125,
      "┬┐": 126,
      "├א": 127,
      "├ב": 128,
      "├ג": 129,
      "├ד": 130,
      "├ה": 131,
      "├ו": 132,
      "├ז": 133,
      "├ח": 134,
      "├ט": 135,
      "├י": 136,
      "├ך": 137,
      "├כ": 138,
      "├ל": 139,
      "├ם": 140,
      "├מ": 141,
      "├ן": 142,
      "├נ": 143,
      "├ס": 144,
      "├ע": 145,
      "├ף": 146,
      "├פ": 147,
      "├ץ": 148,
      "├צ": 149,
      "├ק": 150,
      "├ר": 151,
      "├ש": 152,
      "├ת": 153,
      "├¢": 154,
      "├£": 155,
      "├¥": 156,
      "├₧": 157,
      "├ƒ": 158,
      "├á": 159,
      "├í": 160,
      "├ó": 161,
      "├ú": 162,
      "├ñ": 163,
      "├Ñ": 164,
      "├ª": 165,
      "├º": 166,
      "├¿": 167,
      "├⌐": 168,
      "├¬": 169,
      "├½": 170,
      "├¼": 171,
      "├¡": 172,
      "├«": 173,
      "├»": 174,
      "├░": 175,
      "├▒": 176,
      "├▓": 177,
      "├│": 178,
      "├┤": 179,
      "├╡": 180,
      "├╢": 181,
      "├╖": 182,
      "├╕": 183,
      "├╣": 184,
      "├║": 185,
      "├╗": 186,
      "├╝": 187,
      "├╜": 188,
      "├╛": 189,
      "├┐": 190,
      "─א": 191,
      "─ב": 192,
      "─ג": 193,
      "─ד": 194,
      "─ה": 195,
      "─ו": 196,
      "─ז": 197,
      "─ח": 198,
      "─ט": 199,
      "─י": 200,
      "─ך": 201,
      "─כ": 202,
      "─ל": 203,
      "─ם": 204,
      "─מ": 205,
      "─ן": 206,
      "─נ": 207,
      "─ס": 208,
      "─ע": 209,
      "─ף": 210,
      "─פ": 211,
      "─ץ": 212,
      "─צ": 213,
      "─ק": 214,
      "─ר": 215,
      "─ש": 216,
      "─ת": 217,
      "─¢": 218,
      "─£": 219,
      "─¥": 220,
      "─₧": 221,
      "─ƒ": 222,
      "─á": 223,
      "─í": 224,
      "─ó": 225,
      "─ú": 226,
      "─ñ": 227,
      "─Ñ": 228,
      "─ª": 229,
      "─º": 230,
      "─¿": 231,
      "─⌐": 232,
      "─¬": 233,
      "─½": 234,
      "─¼": 235,
      "─¡": 236,
      "─«": 237,
      "─»": 238,
      "─░": 239,
      "─▒": 240,
      "─▓": 241,
      "─│": 242,
      "─┤": 243,
      "─╡": 244,
      "─╢": 245,
      "─╖": 246,
      "─╕": 247,
      "─╣": 248,
      "─║": 249,
      "─╗": 250,
      "─╝": 251,
      "─╜": 252,
      "─╛": 253,
      "─┐": 254,
      "┼א": 255,
      "┼ב": 256,
      "┼ג": 257,
      "┼ד": 258,
      "─áx": 259,
      "─áxe": 260,
      "─áxa": 261,
      "─áxc": 262,
      "─áxf": 263,
      "─áxb": 264,
      "─áxd": 265,
      "48": 266,
      "─áxaf": 267,
      "01": 268,
      "82": 269,
      "11": 270,
      "15": 271,
      "13": 272,
      "31": 273,
      "─áxac": 274,
      "73": 275,
      "─áxfd": 276,
      "─áxbc": 277,
      "19": 278,
      "26": 279,
      "─áxcb": 280,
      "12": 281,
      "─áxcc": 282,
      "08": 283,
      "25": 284,
      "41": 285,
      "02": 286,
      "45": 287,
      "93": 288,
      "─áxdc": 289,
      "80": 290,
      "─áxeb": 291,
      "84": 292,
      "50": 293,
      "─áxdb": 294,
      "65": 295,
      "43": 296,
      "66": 297,
      "─áxca": 298,
      "59": 299,
      "─áxfb": 300,
      "46": 301,
      "91": 302,
      "22": 303,
      "─áxdf": 304,
      "56": 305,
      "─áxed": 306,
      "23": 307,
      "77": 308,
      "─áxee": 309,
      "─áxbd": 310,
      "75": 311,
      "86": 312,
      "─áxfa": 313,
      "74": 314,
      "97": 315,
      "─áxaa": 316,
      "03": 317,
      "60": 318,
      "10": 319,
      "40": 320,
      "─áxfc": 321,
      "─áxef": 322,
      "─áxab": 323,
      "61": 324,
      "63": 325,
      "88": 326,
      "16": 327,
      "18": 328,
      "58": 329,
      "57": 330,
      "76": 331,
      "55": 332,
      "─áxad": 333,
      "51": 334,
      "07": 335,
      "─áxfe": 336,
      "29": 337,
      "30": 338,
      "92": 339,
      "─áxce": 340,
      "62": 341,
      "09": 342,
      "95": 343,
      "53": 344,
      "39": 345,
      "─áxcd": 346,
      "33": 347,
      "54": 348,
      "81": 349,
      "64": 350,
      "94": 351,
      "36": 352,
      "─áxde": 353,
      "27": 354,
      "52": 355,
      "47": 356,
      "─áxdd": 357,
      "49": 358,
      "69": 359,
      "85": 360,
      "35": 361,
      "32": 362,
      "79": 363,
      "89": 364,
      "67": 365,
      "─áxda": 366,
      "─áxcf": 367,
      "─áxba": 368,
      "05": 369,
      "─áxbb": 370,
      "70": 371,
      "─áxbf": 372,
      "17": 373,
      "─áxae": 374,
      "98": 375,
      "24": 376,
      "68": 377,
      "─áxea": 378,
      "42": 379,
      "87": 380,
      "90": 381,
      "00": 382,
      "34": 383,
      "44": 384,
      "96": 385,
      "14": 386,
      "04": 387,
      "38": 388,
      "06": 389,
      "20": 390,
      "─áxff": 391,
      "78": 392,
      "99": 393,
      "21": 394,
      "─áxec": 395,
      "─áxbe": 396,
      "71": 397,
      "28": 398,
      "72": 399,
      "83": 400,
      "37": 401,
      "xa": 402,
      "xc": 403,
      "xf": 404,
      "xd": 405,
      "xb": 406,
      "xe": 407,
      "xac": 408,
      "xce": 409,
      "xab": 410,
      "xae": 411,
      "xca": 412,
      "xfa": 413,
      "xec": 414,
      "xaa": 415,
      "xaf": 416,
      "xcc": 417,
      "xfb": 418,
      "xfd": 419,
      "xda": 420,
      "xdf": 421,
      "xba": 422,
      "xbb": 423,
      "xee": 424
    },
    "merges": [
      [
        "─á",
        "x"
      ],
      [
        "─áx",
        "e"
      ],
      [
        "─áx",
        "a"
      ],
      [
        "─áx",
        "c"
      ],
      [
        "─áx",
        "f"
      ],
      [
        "─áx",
        "b"
      ],
      [
        "─áx",
        "d"
      ],
      [
        "4",
        "8"
      ],
      [
        "─áxa",
        "f"
      ],
      [
        "0",
        "1"
      ],
      [
        "8",
        "2"
      ],
      [
        "1",
        "1"
      ],
      [
        "1",
        "5"
      ],
      [
        "1",
        "3"
      ],
      [
        "3",
        "1"
      ],
      [
        "─áxa",
        "c"
      ],
      [
        "7",
        "3"
      ],
      [
        "─áxf",
        "d"
      ],
      [
        "─áxb",
        "c"
      ],
      [
        "1",
        "9"
      ],
      [
        "2",
        "6"
      ],
      [
        "─áxc",
        "b"
      ],
      [
        "1",
        "2"
      ],
      [
        "─áxc",
        "c"
      ],
      [
        "0",
        "8"
      ],
      [
        "2",
        "5"
      ],
      [
        "4",
        "1"
      ],
      [
        "0",
        "2"
      ],
      [
        "4",
        "5"
      ],
      [
        "9",
        "3"
      ],
      [
        "─áxd",
        "c"
      ],
      [
        "8",
        "0"
      ],
      [
        "─áxe",
        "b"
      ],
      [
        "8",
        "4"
      ],
      [
        "5",
        "0"
      ],
      [
        "─áxd",
        "b"
      ],
      [
        "6",
        "5"
      ],
      [
        "4",
        "3"
      ],
      [
        "6",
        "6"
      ],
      [
        "─áxc",
        "a"
      ],
      [
        "5",
        "9"
      ],
      [
        "─áxf",
        "b"
      ],
      [
        "4",
        "6"
      ],
      [
        "9",
        "1"
      ],
      [
        "2",
        "2"
      ],
      [
        "─áxd",
        "f"
      ],
      [
        "5",
        "6"
      ],
      [
        "─áxe",
        "d"
      ],
      [
        "2",
        "3"
      ],
      [
        "7",
        "7"
      ],
      [
        "─áxe",
        "e"
      ],
      [
        "─áxb",
        "d"
      ],
      [
        "7",
        "5"
      ],
      [
        "8",
        "6"
      ],
      [
        "─áxf",
        "a"
      ],
      [
        "7",
        "4"
      ],
      [
        "9",
        "7"
      ],
      [
        "─áxa",
        "a"
      ],
      [
        "0",
        "3"
      ],
      [
        "6",
        "0"
      ],
      [
        "1",
        "0"
      ],
      [
        "4",
        "0"
      ],
      [
        "─áxf",
        "c"
      ],
      [
        "─áxe",
        "f"
      ],
      [
        "─áxa",
        "b"
      ],
      [
        "6",
        "1"
      ],
      [
        "6",
        "3"
      ],
      [
        "8",
        "8"
      ],
      [
        "1",
        "6"
      ],
      [
        "1",
        "8"
      ],
      [
        "5",
        "8"
      ],
      [
        "5",
        "7"
      ],
      [
        "7",
        "6"
      ],
      [
        "5",
        "5"
      ],
      [
        "─áxa",
        "d"
      ],
      [
        "5",
        "1"
      ],
      [
        "0",
        "7"
      ],
      [
        "─áxf",
        "e"
      ],
      [
        "2",
        "9"
      ],
      [
        "3",
        "0"
      ],
      [
        "9",
        "2"
      ],
      [
        "─áxc",
        "e"
      ],
      [
        "6",
        "2"
      ],
      [
        "0",
        "9"
      ],
      [
        "9",
        "5"
      ],
      [
        "5",
        "3"
      ],
      [
        "3",
        "9"
      ],
      [
        "─áxc",
        "d"
      ],
      [
        "3",
        "3"
      ],
      [
        "5",
        "4"
      ],
      [
        "8",
        "1"
      ],
      [
        "6",
        "4"
      ],
      [
        "9",
        "4"
      ],
      [
        "3",
        "6"
      ],
      [
        "─áxd",
        "e"
      ],
      [
        "2",
        "7"
      ],
      [
        "5",
        "2"
      ],
      [
        "4",
        "7"
      ],
      [
        "─áxd",
        "d"
      ],
      [
        "4",
        "9"
      ],
      [
        "6",
        "9"
      ],
      [
        "8",
        "5"
      ],
      [
        "3",
        "5"
      ],
      [
        "3",
        "2"
      ],
      [
        "7",
        "9"
      ],
      [
        "8",
        "9"
      ],
      [
        "6",
        "7"
      ],
      [
        "─áxd",
        "a"
      ],
      [
        "─áxc",
        "f"
      ],
      [
        "─áxb",
        "a"
      ],
      [
        "0",
        "5"
      ],
      [
        "─áxb",
        "b"
      ],
      [
        "7",
        "0"
      ],
      [
        "─áxb",
        "f"
      ],
      [
        "1",
        "7"
      ],
      [
        "─áxa",
        "e"
      ],
      [
        "9",
        "8"
      ],
      [
        "2",
        "4"
      ],
      [
        "6",
        "8"
      ],
      [
        "─áxe",
        "a"
      ],
      [
        "4",
        "2"
      ],
      [
        "8",
        "7"
      ],
      [
        "9",
        "0"
      ],
      [
        "0",
        "0"
      ],
      [
        "3",
        "4"
      ],
      [
        "4",
        "4"
      ],
      [
        "9",
        "6"
      ],
      [
        "1",
        "4"
      ],
      [
        "0",
        "4"
      ],
      [
        "3",
        "8"
      ],
      [
        "0",
        "6"
      ],
      [
        "2",
        "0"
      ],
      [
        "─áxf",
        "f"
      ],
      [
        "7",
        "8"
      ],
      [
        "9",
        "9"
      ],
      [
        "2",
        "1"
      ],
      [
        "─áxe",
        "c"
      ],
      [
        "─áxb",
        "e"
      ],
      [
        "7",
        "1"
      ],
      [
        "2",
        "8"
      ],
      [
        "7",
        "2"
      ],
      [
        "8",
        "3"
      ],
      [
        "3",
        "7"
      ],
      [
        "x",
        "a"
      ],
      [
        "x",
        "c"
      ],
      [
        "x",
        "f"
      ],
      [
        "x",
        "d"
      ],
      [
        "x",
        "b"
      ],
      [
        "x",
        "e"
      ],
      [
        "xa",
        "c"
      ],
      [
        "xc",
        "e"
      ],
      [
        "xa",
        "b"
      ],
      [
        "xa",
        "e"
      ],
      [
        "xc",
        "a"
      ],
      [
        "xf",
        "a"
      ],
      [
        "xe",
        "c"
      ],
      [
        "xa",
        "a"
      ],
      [
        "xa",
        "f"
      ],
      [
        "xc",
        "c"
      ],
      [
        "xf",
        "b"
      ],
      [
        "xf",
        "d"
      ],
      [
        "xd",
        "a"
      ],
      [
        "xd",
        "f"
      ],
      [
        "xb",
        "a"
      ],
      [
        "xb",
        "b"
      ],
      [
        "xe",
        "e"
      ]
    ]
  }
}